-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: localhost    Database: temple_thailand
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `temples`
--

DROP TABLE IF EXISTS `temples`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `temples` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `temple_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `location` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sector` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `popular` int NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `temples`
--

LOCK TABLES `temples` WRITE;
/*!40000 ALTER TABLE `temples` DISABLE KEYS */;
INSERT INTO `temples` VALUES (1,'วัดร่องขุ่น','ที่ตั้ง : 60 หมู่ 1 ถนนพหลโยธิน ตำบลป่าอ้อดอนไชย อำเภอเมืองเชียงราย จังหวัดเชียงราย','ตั้งอยู่ในอำเภอเมืองเชียงราย จังหวัดเชียงราย ออกแบบและก่อสร้างโดยศิลปินแห่งชาติที่มีชื่อเสียง คือ  อาจารย์เฉลิมชัย โฆษิตพิพัฒน์ โดยเป็นการถอดแบบมาจากวัดมิ่งเมือง จังหวัดน่าน เดิมทีเป็นวัดเล็ก ๆ ค่อนข้างเสื่อมโทรม แต่ด้วยความตั้งใจ ศรัทธา และปณิธานที่มุ่งมั่น ก่อเกิดเป็นศาสนสถานที่สวยงามด้วยสถาปัตยกรรมและงานศิลปะ เต็มไปด้วยลวดลายอ่อนช้อยประณีต ดึงดูดนักท่องเที่ยวให้มาเยี่ยมชมวัดนี้อย่างคับคั่งตลอดปี และยังโดดเด่นด้วยอุโบสถที่มีสีขาวบริสุทธิ์สะอาด จนกลายเป็นเอกลักษณ์และเป็นที่จดจำของนักท่องเที่ยวชาวต่างชาติที่พากันเรียกวัดร่องขุ่นว่า วัดขาว (White Temple) ทำให้วัดแห่งนี้กลายเป็นหนึ่งในจุดเช็กอินของจังหวัดเชียงราย เรียกว่าถ้ามาเชียงรายแล้วไม่มาวัดนี้ถือว่ามาไม่ถึงเลยทีเดียว','img/1733133758.jpg','ภาคเหนือ',4,'2024-12-02 01:40:52','2024-12-02 03:02:38'),(2,'วัดร่องขุ่น','ที่ตั้ง : 60 หมู่ 1 ถนนพหลโยธิน ตำบลป่าอ้อดอนไชย อำเภอเมืองเชียงราย จังหวัดเชียงราย','ตั้งอยู่ในอำเภอเมืองเชียงราย จังหวัดเชียงราย ออกแบบและก่อสร้างโดยศิลปินแห่งชาติที่มีชื่อเสียง คือ  อาจารย์เฉลิมชัย โฆษิตพิพัฒน์ โดยเป็นการถอดแบบมาจากวัดมิ่งเมือง จังหวัดน่าน เดิมทีเป็นวัดเล็ก ๆ ค่อนข้างเสื่อมโทรม แต่ด้วยความตั้งใจ ศรัทธา และปณิธานที่มุ่งมั่น ก่อเกิดเป็นศาสนสถานที่สวยงามด้วยสถาปัตยกรรมและงานศิลปะ เต็มไปด้วยลวดลายอ่อนช้อยประณีต ดึงดูดนักท่องเที่ยวให้มาเยี่ยมชมวัดนี้อย่างคับคั่งตลอดปี และยังโดดเด่นด้วยอุโบสถที่มีสีขาวบริสุทธิ์สะอาด จนกลายเป็นเอกลักษณ์และเป็นที่จดจำของนักท่องเที่ยวชาวต่างชาติที่พากันเรียกวัดร่องขุ่นว่า วัดขาว (White Temple) ทำให้วัดแห่งนี้กลายเป็นหนึ่งในจุดเช็กอินของจังหวัดเชียงราย เรียกว่าถ้ามาเชียงรายแล้วไม่มาวัดนี้ถือว่ามาไม่ถึงเลยทีเดียว','img/1733128880.jpg','ภาคตะวันออก',4,'2024-12-02 01:41:20','2024-12-02 01:41:20'),(3,'วัดร่องเสือเต้น','ที่ตั้ง : 306 หมู่ 2 ถนนแม่กก ตำบลริมกก อำเภอเมืองเชียงราย จังหวัดเชียงราย','อีกหนึ่งแลนด์มาร์กวัดสวย ๆ ของจังหวัดเชียงราย กับวัดร่องเสือเต้น ตั้งอยู่ในตัวเมืองเชียงราย ไฮไลต์ของวัดนี้คือ อุโบสถสีน้ำเงินฟ้าตัดกับสีทอง โดยสีน้ำเงินฟ้าของตัววิหารนั้นแสดงถึงธรรมะขององค์สมเด็จพระสัมมาสัมพุทธเจ้าที่ขจรขจายไปทั่วโลก นอกจากนี้ด้านหน้าโบสถ์จะมีบันไดพญานาคที่เน้นลักษณะโครงสร้างเข้มแข็ง เขี้ยวเล็บแหลมคมดูน่าเกรงขาม แต่มีความอ่อนช้อยในแบบล้านนา ทั้งนี้ บริเวณรอบอุโบสถจะมีสัตว์ในป่าหิมพานต์อยู่ด้วย สำหรับภายในวิหารมีพระประธานสีขาวองค์ใหญ่ ชื่อว่า “พระพุทธรัชมงคลบดีตรีโลกนาถ” และมีภาพเขียนจิตรกรรมเรื่องราวเกี่ยวกับพุทธประวัติที่มีความอ่อนช้อยสวยงามของลายเส้น ใครชอบงานศิลปะ ชอบถ่ายรูป บอกเลยว่าห้ามพลาดที่จะมาชมความสวยงามและมาไหว้พระที่นี่','img/1733128907.jpg','ภาคกลาง',4,'2024-12-02 01:41:47','2024-12-02 01:41:47'),(4,'วัดร่องเสือเต้น','ที่ตั้ง : 306 หมู่ 2 ถนนแม่กก ตำบลริมกก อำเภอเมืองเชียงราย จังหวัดเชียงราย','อีกหนึ่งแลนด์มาร์กวัดสวย ๆ ของจังหวัดเชียงราย กับวัดร่องเสือเต้น ตั้งอยู่ในตัวเมืองเชียงราย ไฮไลต์ของวัดนี้คือ อุโบสถสีน้ำเงินฟ้าตัดกับสีทอง โดยสีน้ำเงินฟ้าของตัววิหารนั้นแสดงถึงธรรมะขององค์สมเด็จพระสัมมาสัมพุทธเจ้าที่ขจรขจายไปทั่วโลก นอกจากนี้ด้านหน้าโบสถ์จะมีบันไดพญานาคที่เน้นลักษณะโครงสร้างเข้มแข็ง เขี้ยวเล็บแหลมคมดูน่าเกรงขาม แต่มีความอ่อนช้อยในแบบล้านนา ทั้งนี้ บริเวณรอบอุโบสถจะมีสัตว์ในป่าหิมพานต์อยู่ด้วย สำหรับภายในวิหารมีพระประธานสีขาวองค์ใหญ่ ชื่อว่า “พระพุทธรัชมงคลบดีตรีโลกนาถ” และมีภาพเขียนจิตรกรรมเรื่องราวเกี่ยวกับพุทธประวัติที่มีความอ่อนช้อยสวยงามของลายเส้น ใครชอบงานศิลปะ ชอบถ่ายรูป บอกเลยว่าห้ามพลาดที่จะมาชมความสวยงามและมาไหว้พระที่นี่','img/1733128953.jpg','ภาคใต้',4,'2024-12-02 01:42:33','2024-12-02 01:42:33'),(5,'วัดร่องเสือเต้น','ที่ตั้ง : 306 หมู่ 2 ถนนแม่กก ตำบลริมกก อำเภอเมืองเชียงราย จังหวัดเชียงราย','อีกหนึ่งแลนด์มาร์กวัดสวย ๆ ของจังหวัดเชียงราย กับวัดร่องเสือเต้น ตั้งอยู่ในตัวเมืองเชียงราย ไฮไลต์ของวัดนี้คือ อุโบสถสีน้ำเงินฟ้าตัดกับสีทอง โดยสีน้ำเงินฟ้าของตัววิหารนั้นแสดงถึงธรรมะขององค์สมเด็จพระสัมมาสัมพุทธเจ้าที่ขจรขจายไปทั่วโลก นอกจากนี้ด้านหน้าโบสถ์จะมีบันไดพญานาคที่เน้นลักษณะโครงสร้างเข้มแข็ง เขี้ยวเล็บแหลมคมดูน่าเกรงขาม แต่มีความอ่อนช้อยในแบบล้านนา ทั้งนี้ บริเวณรอบอุโบสถจะมีสัตว์ในป่าหิมพานต์อยู่ด้วย สำหรับภายในวิหารมีพระประธานสีขาวองค์ใหญ่ ชื่อว่า “พระพุทธรัชมงคลบดีตรีโลกนาถ” และมีภาพเขียนจิตรกรรมเรื่องราวเกี่ยวกับพุทธประวัติที่มีความอ่อนช้อยสวยงามของลายเส้น ใครชอบงานศิลปะ ชอบถ่ายรูป บอกเลยว่าห้ามพลาดที่จะมาชมความสวยงามและมาไหว้พระที่นี่','img/1733131498.jpg','ภาคเหนือ',4,'2024-12-02 02:24:58','2024-12-02 02:24:58'),(7,'วัดร่องเสือเต้น','ที่ตั้ง : 306 หมู่ 2 ถนนแม่กก ตำบลริมกก อำเภอเมืองเชียงราย จังหวัดเชียงราย','อีกหนึ่งแลนด์มาร์กวัดสวย ๆ ของจังหวัดเชียงราย กับวัดร่องเสือเต้น ตั้งอยู่ในตัวเมืองเชียงราย ไฮไลต์ของวัดนี้คือ อุโบสถสีน้ำเงินฟ้าตัดกับสีทอง โดยสีน้ำเงินฟ้าของตัววิหารนั้นแสดงถึงธรรมะขององค์สมเด็จพระสัมมาสัมพุทธเจ้าที่ขจรขจายไปทั่วโลก นอกจากนี้ด้านหน้าโบสถ์จะมีบันไดพญานาคที่เน้นลักษณะโครงสร้างเข้มแข็ง เขี้ยวเล็บแหลมคมดูน่าเกรงขาม แต่มีความอ่อนช้อยในแบบล้านนา ทั้งนี้ บริเวณรอบอุโบสถจะมีสัตว์ในป่าหิมพานต์อยู่ด้วย สำหรับภายในวิหารมีพระประธานสีขาวองค์ใหญ่ ชื่อว่า “พระพุทธรัชมงคลบดีตรีโลกนาถ” และมีภาพเขียนจิตรกรรมเรื่องราวเกี่ยวกับพุทธประวัติที่มีความอ่อนช้อยสวยงามของลายเส้น ใครชอบงานศิลปะ ชอบถ่ายรูป บอกเลยว่าห้ามพลาดที่จะมาชมความสวยงามและมาไหว้พระที่นี่','img/1733131589.jpg','ภาคเหนือ',4,'2024-12-02 02:26:29','2024-12-02 02:26:29'),(8,'วัดร่องเสือเต้น','ที่ตั้ง : 306 หมู่ 2 ถนนแม่กก ตำบลริมกก อำเภอเมืองเชียงราย จังหวัดเชียงราย','อีกหนึ่งแลนด์มาร์กวัดสวย ๆ ของจังหวัดเชียงราย กับวัดร่องเสือเต้น ตั้งอยู่ในตัวเมืองเชียงราย ไฮไลต์ของวัดนี้คือ อุโบสถสีน้ำเงินฟ้าตัดกับสีทอง โดยสีน้ำเงินฟ้าของตัววิหารนั้นแสดงถึงธรรมะขององค์สมเด็จพระสัมมาสัมพุทธเจ้าที่ขจรขจายไปทั่วโลก นอกจากนี้ด้านหน้าโบสถ์จะมีบันไดพญานาคที่เน้นลักษณะโครงสร้างเข้มแข็ง เขี้ยวเล็บแหลมคมดูน่าเกรงขาม แต่มีความอ่อนช้อยในแบบล้านนา ทั้งนี้ บริเวณรอบอุโบสถจะมีสัตว์ในป่าหิมพานต์อยู่ด้วย สำหรับภายในวิหารมีพระประธานสีขาวองค์ใหญ่ ชื่อว่า “พระพุทธรัชมงคลบดีตรีโลกนาถ” และมีภาพเขียนจิตรกรรมเรื่องราวเกี่ยวกับพุทธประวัติที่มีความอ่อนช้อยสวยงามของลายเส้น ใครชอบงานศิลปะ ชอบถ่ายรูป บอกเลยว่าห้ามพลาดที่จะมาชมความสวยงามและมาไหว้พระที่นี่','img/1733131897.jpg','ภาคเหนือ',3,'2024-12-02 02:31:37','2024-12-02 02:31:37');
/*!40000 ALTER TABLE `temples` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-12-02 18:13:48
